Revit 2027 API
ParameterTypeId.TrussFamilyBottomChordStructuralTypesParam Property
 "Structural Framing Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TrussFamilyBottomChordStructuralTypesParam { get; }
Public Shared ReadOnly Property TrussFamilyBottomChordStructuralTypesParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TrussFamilyBottomChordStructuralTypesParam {
	ForgeTypeId^ get ();
}
static member TrussFamilyBottomChordStructuralTypesParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace